{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model", "config": {"name": "inception_v1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 100, 100, 3], "sparse": false}}, {"name": "conv_1_7x7/2", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv_1_7x7/2", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [7, 7], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [2, 2], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "max_pool_1_3x3/2", "inbound_nodes": [[["conv_1_7x7/2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool_1_3x3/2", "pool_size": [3, 3], "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv_2a_3x3/1", "inbound_nodes": [[["max_pool_1_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv_2a_3x3/1", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"name": "conv_2b_3x3/1", "inbound_nodes": [[["conv_2a_3x3/1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv_2b_3x3/1", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 192, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"name": "max_pool_2_3x3/2", "inbound_nodes": [[["conv_2b_3x3/1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool_2_3x3/2", "pool_size": [3, 3], "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_2", "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_4", "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [3, 3], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_1", "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_5", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_5", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [5, 5], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_6", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "inception_3a", "inbound_nodes": [[["conv2d_1", 0, 0, {}], ["conv2d_3", 0, 0, {}], ["conv2d_5", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "name": "inception_3a", "trainable": true}}, {"name": "conv2d_8", "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_8", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_10", "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_10", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "max_pooling2d_2", "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [3, 3], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_7", "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_7", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_9", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_9", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 192, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_11", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_11", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [5, 5], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_12", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_12", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "inception_3b", "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["conv2d_9", 0, 0, {}], ["conv2d_11", 0, 0, {}], ["conv2d_12", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "name": "inception_3b", "trainable": true}}, {"name": "max_pool_3_3x3/2", "inbound_nodes": [[["inception_3b", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool_3_3x3/2", "pool_size": [3, 3], "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_14", "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_14", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_16", "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_16", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "max_pooling2d_3", "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [3, 3], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_13", "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_13", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 192, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_15", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_15", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 208, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_17", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_17", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [5, 5], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_18", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_18", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "inception_4a", "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["conv2d_15", 0, 0, {}], ["conv2d_17", 0, 0, {}], ["conv2d_18", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "name": "inception_4a", "trainable": true}}, {"name": "conv2d_21", "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_21", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 112, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_23", "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_23", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 24, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "max_pooling2d_4", "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "pool_size": [3, 3], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_20", "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_20", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 160, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_22", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_22", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 224, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_24", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_24", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [5, 5], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_25", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_25", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "inception_4b", "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["conv2d_22", 0, 0, {}], ["conv2d_24", 0, 0, {}], ["conv2d_25", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "name": "inception_4b", "trainable": true}}, {"name": "conv2d_27", "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_27", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_29", "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_29", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 24, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "max_pooling2d_5", "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "pool_size": [3, 3], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_26", "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_26", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_28", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_28", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_30", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_30", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [5, 5], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_31", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_31", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "inception_4c", "inbound_nodes": [[["conv2d_26", 0, 0, {}], ["conv2d_28", 0, 0, {}], ["conv2d_30", 0, 0, {}], ["conv2d_31", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "name": "inception_4c", "trainable": true}}, {"name": "conv2d_33", "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_33", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 144, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_35", "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_35", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "max_pooling2d_6", "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "pool_size": [3, 3], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_32", "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_32", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 112, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_34", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_34", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 288, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_36", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_36", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [5, 5], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_37", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_37", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "inception_4d", "inbound_nodes": [[["conv2d_32", 0, 0, {}], ["conv2d_34", 0, 0, {}], ["conv2d_36", 0, 0, {}], ["conv2d_37", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "name": "inception_4d", "trainable": true}}, {"name": "conv2d_40", "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_40", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 160, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_42", "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_42", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "max_pooling2d_7", "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "pool_size": [3, 3], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_39", "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_39", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_41", "inbound_nodes": [[["conv2d_40", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_41", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 320, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_43", "inbound_nodes": [[["conv2d_42", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_43", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [5, 5], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_44", "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_44", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "inception_4e", "inbound_nodes": [[["conv2d_39", 0, 0, {}], ["conv2d_41", 0, 0, {}], ["conv2d_43", 0, 0, {}], ["conv2d_44", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "name": "inception_4e", "trainable": true}}, {"name": "max_pool_4_3x3/2", "inbound_nodes": [[["inception_4e", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool_4_3x3/2", "pool_size": [3, 3], "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_46", "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_46", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 160, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_48", "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_48", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "max_pooling2d_8", "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "pool_size": [3, 3], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_45", "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_45", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_47", "inbound_nodes": [[["conv2d_46", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_47", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 320, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_49", "inbound_nodes": [[["conv2d_48", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_49", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [5, 5], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_50", "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_50", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "inception_5a", "inbound_nodes": [[["conv2d_45", 0, 0, {}], ["conv2d_47", 0, 0, {}], ["conv2d_49", 0, 0, {}], ["conv2d_50", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "name": "inception_5a", "trainable": true}}, {"name": "conv2d_52", "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_52", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 192, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_54", "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_54", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "max_pooling2d_9", "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "pool_size": [3, 3], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"name": "average_pooling2d_1", "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "pool_size": [5, 5], "strides": [3, 3], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"name": "average_pooling2d_2", "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "pool_size": [5, 5], "strides": [3, 3], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_51", "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_51", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 384, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_53", "inbound_nodes": [[["conv2d_52", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_53", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 384, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_55", "inbound_nodes": [[["conv2d_54", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_55", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [5, 5], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_56", "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_56", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_19", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"name": "conv2d_38", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_38", "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"name": "inception_5b", "inbound_nodes": [[["conv2d_51", 0, 0, {}], ["conv2d_53", 0, 0, {}], ["conv2d_55", 0, 0, {}], ["conv2d_56", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "name": "inception_5b", "trainable": true}}, {"name": "flatten_1", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"name": "flatten_2", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true}}, {"name": "avg_pool_5_3x3/1", "inbound_nodes": [[["inception_5b", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"data_format": "channels_last", "name": "avg_pool_5_3x3/1", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 1024, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"name": "dense_2", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 1024, "name": "dense_2", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"name": "dropout_3", "inbound_nodes": [[["avg_pool_5_3x3/1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "rate": 0.4, "name": "dropout_3", "seed": null, "noise_shape": null}}, {"name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "rate": 0.7, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "rate": 0.7, "name": "dropout_2", "seed": null, "noise_shape": null}}, {"name": "output", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 7, "name": "output", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"name": "auxilliary_output_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 7, "name": "auxilliary_output_1", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"name": "auxilliary_output_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 7, "name": "auxilliary_output_2", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}],