{"backend": "tensorflow", "config": {"output_layers": [["output", 0, 0], ["auxilliary_output_1", 0, 0], ["auxilliary_output_2", 0, 0]], "name": "inception_v1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 100, 100, 3], "sparse": false, "name": "input_1"}}, {"name": "conv_1_7x7/2", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv_1_7x7/2", "bias_constraint": null, "filters": 64, "kernel_size": [7, 7], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "max_pool_1_3x3/2", "inbound_nodes": [[["conv_1_7x7/2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool_1_3x3/2", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"name": "conv_2a_3x3/1", "inbound_nodes": [[["max_pool_1_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv_2a_3x3/1", "bias_constraint": null, "filters": 64, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv_2b_3x3/1", "inbound_nodes": [[["conv_2a_3x3/1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv_2b_3x3/1", "bias_constraint": null, "filters": 192, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "max_pool_2_3x3/2", "inbound_nodes": [[["conv_2b_3x3/1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool_2_3x3/2", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"name": "conv2d_2", "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "filters": 96, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_4", "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_4", "bias_constraint": null, "filters": 16, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1]}}, {"name": "conv2d_1", "inbound_nodes": [[["max_pool_2_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "filters": 64, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "filters": 128, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_5", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_5", "bias_constraint": null, "filters": 32, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_6", "bias_constraint": null, "filters": 32, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "inception_3a", "inbound_nodes": [[["conv2d_1", 0, 0, {}], ["conv2d_3", 0, 0, {}], ["conv2d_5", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "name": "inception_3a"}}, {"name": "conv2d_8", "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_8", "bias_constraint": null, "filters": 128, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_10", "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_10", "bias_constraint": null, "filters": 32, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "max_pooling2d_2", "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1]}}, {"name": "conv2d_7", "inbound_nodes": [[["inception_3a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_7", "bias_constraint": null, "filters": 128, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_9", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_9", "bias_constraint": null, "filters": 192, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_11", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_11", "bias_constraint": null, "filters": 96, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_12", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_12", "bias_constraint": null, "filters": 64, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "inception_3b", "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["conv2d_9", 0, 0, {}], ["conv2d_11", 0, 0, {}], ["conv2d_12", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "name": "inception_3b"}}, {"name": "max_pool_3_3x3/2", "inbound_nodes": [[["inception_3b", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool_3_3x3/2", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"name": "conv2d_14", "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_14", "bias_constraint": null, "filters": 96, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_16", "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_16", "bias_constraint": null, "filters": 16, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "max_pooling2d_3", "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1]}}, {"name": "conv2d_13", "inbound_nodes": [[["max_pool_3_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_13", "bias_constraint": null, "filters": 192, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_15", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_15", "bias_constraint": null, "filters": 208, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_17", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_17", "bias_constraint": null, "filters": 48, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_18", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_18", "bias_constraint": null, "filters": 64, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "inception_4a", "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["conv2d_15", 0, 0, {}], ["conv2d_17", 0, 0, {}], ["conv2d_18", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "name": "inception_4a"}}, {"name": "conv2d_21", "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_21", "bias_constraint": null, "filters": 112, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_23", "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_23", "bias_constraint": null, "filters": 24, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "max_pooling2d_4", "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1]}}, {"name": "conv2d_20", "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_20", "bias_constraint": null, "filters": 160, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_22", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_22", "bias_constraint": null, "filters": 224, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_24", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_24", "bias_constraint": null, "filters": 64, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_25", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_25", "bias_constraint": null, "filters": 64, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "inception_4b", "inbound_nodes": [[["conv2d_20", 0, 0, {}], ["conv2d_22", 0, 0, {}], ["conv2d_24", 0, 0, {}], ["conv2d_25", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "name": "inception_4b"}}, {"name": "conv2d_27", "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_27", "bias_constraint": null, "filters": 128, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_29", "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_29", "bias_constraint": null, "filters": 24, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "max_pooling2d_5", "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1]}}, {"name": "conv2d_26", "inbound_nodes": [[["inception_4b", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_26", "bias_constraint": null, "filters": 128, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_28", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_28", "bias_constraint": null, "filters": 256, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_30", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_30", "bias_constraint": null, "filters": 64, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_31", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_31", "bias_constraint": null, "filters": 64, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "inception_4c", "inbound_nodes": [[["conv2d_26", 0, 0, {}], ["conv2d_28", 0, 0, {}], ["conv2d_30", 0, 0, {}], ["conv2d_31", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "name": "inception_4c"}}, {"name": "conv2d_33", "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_33", "bias_constraint": null, "filters": 144, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_35", "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_35", "bias_constraint": null, "filters": 32, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "max_pooling2d_6", "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1]}}, {"name": "conv2d_32", "inbound_nodes": [[["inception_4c", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_32", "bias_constraint": null, "filters": 112, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_34", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_34", "bias_constraint": null, "filters": 288, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_36", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_36", "bias_constraint": null, "filters": 64, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_37", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_37", "bias_constraint": null, "filters": 64, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "inception_4d", "inbound_nodes": [[["conv2d_32", 0, 0, {}], ["conv2d_34", 0, 0, {}], ["conv2d_36", 0, 0, {}], ["conv2d_37", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "name": "inception_4d"}}, {"name": "conv2d_40", "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_40", "bias_constraint": null, "filters": 160, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_42", "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_42", "bias_constraint": null, "filters": 32, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "max_pooling2d_7", "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1]}}, {"name": "conv2d_39", "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_39", "bias_constraint": null, "filters": 256, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_41", "inbound_nodes": [[["conv2d_40", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_41", "bias_constraint": null, "filters": 320, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_43", "inbound_nodes": [[["conv2d_42", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_43", "bias_constraint": null, "filters": 128, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_44", "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_44", "bias_constraint": null, "filters": 128, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "inception_4e", "inbound_nodes": [[["conv2d_39", 0, 0, {}], ["conv2d_41", 0, 0, {}], ["conv2d_43", 0, 0, {}], ["conv2d_44", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "name": "inception_4e"}}, {"name": "max_pool_4_3x3/2", "inbound_nodes": [[["inception_4e", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool_4_3x3/2", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"name": "conv2d_46", "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_46", "bias_constraint": null, "filters": 160, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_48", "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_48", "bias_constraint": null, "filters": 32, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "max_pooling2d_8", "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1]}}, {"name": "conv2d_45", "inbound_nodes": [[["max_pool_4_3x3/2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_45", "bias_constraint": null, "filters": 256, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_47", "inbound_nodes": [[["conv2d_46", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_47", "bias_constraint": null, "filters": 320, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_49", "inbound_nodes": [[["conv2d_48", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_49", "bias_constraint": null, "filters": 128, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_50", "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_50", "bias_constraint": null, "filters": 128, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "inception_5a", "inbound_nodes": [[["conv2d_45", 0, 0, {}], ["conv2d_47", 0, 0, {}], ["conv2d_49", 0, 0, {}], ["conv2d_50", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "name": "inception_5a"}}, {"name": "conv2d_52", "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_52", "bias_constraint": null, "filters": 192, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_54", "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_54", "bias_constraint": null, "filters": 48, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "max_pooling2d_9", "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "pool_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1]}}, {"name": "average_pooling2d_1", "inbound_nodes": [[["inception_4a", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "pool_size": [5, 5], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [3, 3]}}, {"name": "average_pooling2d_2", "inbound_nodes": [[["inception_4d", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "pool_size": [5, 5], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [3, 3]}}, {"name": "conv2d_51", "inbound_nodes": [[["inception_5a", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_51", "bias_constraint": null, "filters": 384, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_53", "inbound_nodes": [[["conv2d_52", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_53", "bias_constraint": null, "filters": 384, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_55", "inbound_nodes": [[["conv2d_54", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_55", "bias_constraint": null, "filters": 128, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_56", "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_56", "bias_constraint": null, "filters": 128, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.2}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_19", "bias_constraint": null, "filters": 128, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "conv2d_38", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_38", "bias_constraint": null, "filters": 128, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "inception_5b", "inbound_nodes": [[["conv2d_51", 0, 0, {}], ["conv2d_53", 0, 0, {}], ["conv2d_55", 0, 0, {}], ["conv2d_56", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "name": "inception_5b"}}, {"name": "flatten_1", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"name": "flatten_2", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_2"}}, {"name": "avg_pool_5_3x3/1", "inbound_nodes": [[["inception_5b", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "avg_pool_5_3x3/1"}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 1024, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "dense_2", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 1024, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "dropout_3", "inbound_nodes": [[["avg_pool_5_3x3/1", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.4, "trainable": true, "seed": null, "name": "dropout_3"}}, {"name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.7, "trainable": true, "seed": null, "name": "dropout_1"}}, {"name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.7, "trainable": true, "seed": null, "name": "dropout_2"}}, {"name": "output", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 7, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "output", "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "auxilliary_output_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 7, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "auxilliary_output_1", "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"name": "auxilliary_output_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "config": {"units": 7, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "auxilliary_output_2", "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", 